# -*- coding: utf-8 -*-
menu = {
    '广东': {
        '深圳': {
            '南山': ['海上世界', '世界之窗', '锦绣中华'],
            '福田': ['上沙', '下沙', '京基100'],
            '华强北': ['电子世界', '电子天堂', '元件批发']
         },
        '惠州': {
            '惠阳': ['淡水', '开发区', '新余'],
            '仲恺区': ['陈江', '惠环', '沥林'],
            '龙门县': ['南昆山',  '永汉'],
        },
        '广州': {
            '天河': ['白云']
        }
    },
    '天津': {
        '东丽': {
            '大毕庄': ['向阳']
        },
        '河东': {
            '中山门': ['常州道']
        }
    },
    '杭州': {
        '西湖': {
            '黄龙': ['古荡']
        },
        '滨江': {
            '长河': ['彩虹城']
        }
    }
}
